public class MyClass4HW {
    public static void main(String[] args) {
        //Составьте программу, которая переводит переменную из byte в short
//        int x = 25;
//        short x1 = (short)x;
//        System.out.println(x1);
        //Составьте программу, которая переводит переменную из short в int
//        short x = 340;
//        int x1 = x;
//        System.out.println(x1);
//        //Составьте программу, которая переводит переменную из int в long
//        int x = 100;
//        long x1 = x;
//        System.out.println(x1);
        //Составьте программу, которая переводит переменную из long в int
//        long x = 123;
//        int x1  = (int) x;
//        System.out.println(x1);
        //Составьте программу, которая переводит переменную из float в double
//        float x = 12;
//        double x1 = x;
//        System.out.println(x1);
        //Придумайте способ переводить из int в boolean и наоборот.
//        int x = 1;
        //Придумайте способ переводить из String в boolean.
        //Переведите переменную из char в string
//        char ch = 't';
//        String ch1 = String.valueOf(ch);
//        System.out.println(ch1);
        //Переведите переменную из char в int и наоборот.
//        char ch = 't';
//        int t = ch;
//        System.out.println(t);
        //Пусть int равен от 30 до 150. Переведите каждый int в char,
        //и выведите таблицу, где на каждой строчке есть int и соответствующий ему char
//            for(int i = 30; i < 150;i++){
//
//                System.out.print(i + "-");
//                char ch = (char) i;
//                System.out.println(ch);
//                }
    }
}
