import org.w3c.dom.ls.LSOutput;

import javax.crypto.spec.PSource;
import java.util.Scanner;

public class MyClass5HW {
    public static void main(String[] args) {
        //Пользователь вводит два числа. Возвести второе в степень первого
//        System.out.println("Введите два числа");
//        Scanner scanner = new Scanner(System.in);
//        int x = scanner.nextInt();
//        int y = scanner.nextInt();
//        System.out.println(Math.pow(y, x));
        //Пользователь вводит три числа. Возвести 1 в степень 2, и результат в степень 3
//        System.out.println("введите три числа: ");
//        Scanner scanner = new Scanner(System.in);
//        int x = scanner.nextInt();
//        int y = scanner.nextInt();
//        int z = scanner.nextInt();
//        double pow = Math.pow(x, y);
//        double pow1 = Math.pow(pow, z);
//        System.out.println(pow1);
        //Решить предыдущую задачу, но Math.pow можно использовать только на одной строчке вашей программы(хоть и много раз)
//        System.out.println("введите три числа: ");
//        Scanner scanner = new Scanner(System.in);
//        int x = scanner.nextInt();            //Пришлите решение. не понимаю как сделать это задание
//        int y = scanner.nextInt();
//        int z = scanner.nextInt();
//        double pow = Math.pow(x,y)(Math.pow(x, y));
////        double pow1 = Math.pow(pow, z);
//        System.out.println(pow);

        //Пользователь вводит, две строки. Найти разницу в длине.
//        System.out.println("введите две строки: ");
//        Scanner scanner = new Scanner(System.in);
//        String str = scanner.nextLine();
//        String str2 = scanner.nextLine();
//        System.out.println(str.length() - str2.length());
        //Пользователь вводит три строки. Найти разницу в длине самой короткой и самой длинной.
//        System.out.println("Введите три строки: ");
//        Scanner scanner = new Scanner(System.in);
//        String str1 = scanner.nextLine();             // не понимаю как сделать задание
//        String str2 = scanner.nextLine();
//        String str3 = scanner.nextLine();
//        System.out.println(str1.length() + str2.length() + str3.length());
//        if (str1.length() < str2.length()) {
//            System.out.println(str1);
//        }
//        if (str1.length() < str3.length()) {
//            System.out.println(str1);
//        }
//        if (str2.length() < str1.length()) {
//            System.out.println(str2);
//        }
//        if (str3.length() < str1.length()) {
//            System.out.println(str3);
//        }
//        if (str3.length() < str2.length()) {
//            System.out.println(str3);
//        }if (str1.length() > str2.length()) {
//            System.out.println(str1);
//        }
//        if (str1.length() > str3.length()) {
//            System.out.println(str1);
//        }
//        if (str2.length() > str1.length()) {
//            System.out.println(str2);
//        }
//        if (str3.length() > str1.length()) {
//            System.out.println(str3);
//        }
//        if (str3.length() > str2.length()) {
//            System.out.println(str3);
//        }

        //Сделать калькулятор для трех чисел:
        //пользователь вводит первое, потом оператор, второе, оператор, третье.
        //Посчитать первое на второе, потом результат с третьим.


//        Scanner scanner = new Scanner(System.in);
//        System.out.println("Введите цифру");
//        double x = scanner.nextInt();
//        System.out.println("Введите арфиметический знак");
//        char operator = scanner.next().charAt(0);
//        System.out.println("Введите цифру");
//        double y = scanner.nextInt();
//        System.out.println("Введите арфиметический знак");
//        char operator1 = scanner.next().charAt(0);
//        double z = scanner.nextInt();
//        System.out.println("=");
//
//        double x1 = x + y;
//        double x2 = x1 + z;
//        double x3 = x - y;
//        double x4 = x1 - z;
//        double x5 = x * y;
//        double x6 = x1 * z;
//        double x7 = x / y;
//        double x8 = x1 / z;
//
//
//        if(operator == '+'){
//            System.out.println(x1);
//        } if(operator1 =='+'){
//            System.out.println(x2);
//        }if(operator == '-'){
//            System.out.println(x3);
//        } if(operator1 =='-'){
//            System.out.println(x4);
//        }if(operator == '*'){
//            System.out.println(x5);
//        } if(operator1 =='*'){
//            System.out.println(x6);
//        }if(operator == '/'){
//            System.out.println(x7);
//        } if(operator1 =='/'){
//            System.out.println(x8);
//        }

        //Решить предыдущую задачу, но операции считать по приоритету (умножение и деление выше сложения вычитания).
        //Предыдущий пример даст ответ 11 + 80 равно 91

        //Вывести английский алфавит

//        for (char c = 'A'; c <= 'Z'; c++) {
//            System.out.print(c);
//        }
//        System.out.println();

        //Пользователь вводит N. Вывести букву английского алфавита по счету N
//        Scanner scanner = new Scanner(System.in);
//        int n = scanner.nextInt();
//
//
//        for (char c = 'A'; c <='Z'; c++){
//            System.out.println(c);
//        }
        //Вывести случайную букву английского алфавита
//        double x = Math.random();
//        char x1 = (char) Math.random();
//        x = x1;
//        System.out.println(x);

        //Вывести случайное число от 11 до 22
//        int x = 11;
//        while(x <= 22){
//
//        }
    }
}
