import java.util.Scanner;

public class MyClass6HW {
    public static void main(String[] args) {

//        //Пользователь вводит дробное число. Если оно больше пи, вывести “pimore”
//        System.out.println("Введите дробное число: ");
//        Scanner scanner = new Scanner(System.in);
//        double x = scanner.nextDouble();
//        if(x > Math.PI) {
//            System.out.println("pimore");
//        } else{
//            System.out.println("Пи больше введенного числа");
//        }

        //Пользователь вводит строку. Используя метод .contains(‘ ‘) пробел, определите, ввел пользователь одно слово, или больше
//        Scanner scanner = new Scanner(System.in);
//        String str = scanner.next();
//        System.out.println(str.contains());
        //Пользователь вводит четыре числа. Найти наибольшее из них.
//        Scanner scanner = new Scanner(System.in);
//        System.out.println("введите 4 числа");
//        int x = scanner.nextInt();
//        int x2 = scanner.nextInt();
//        int x3 = scanner.nextInt();
//        int x4 = scanner.nextInt();
//        int y = Math.max(x,x2);
//        int y2 = Math.max(x3,x4);
//        System.out.println(Math.max(y,y2));

    }
}
