import java.util.Scanner;

public class MyClass3HW {
    public static void main(String[] args) {

        //Пользователь вводит строку, выведите ее длину
//        System.out.println("Введите строку: ");
//        Scanner scanner = new Scanner(System.in);
//        String str = String.valueOf(scanner.nextLine());
//        System.out.println(str.length());

        // Пользователь вводит две строки, выведите сумму их длин

//        System.out.println("Введите две строки и я покажу сумму их длин");
//        Scanner scanner = new Scanner(System.in);
//        String str1 = String.valueOf(scanner.nextLine());
//        String str2 = String.valueOf(scanner.nextLine());
//        System.out.println(str1.length() + str2.length());


        //Пользователь вводит три строки. Найти, какая из них короче всех

//        System.out.println("Введите три строки и я посчитаю какая из них короче");
//        Scanner scanner = new Scanner(System.in);
//        String str1 = String.valueOf(scanner.nextLine());
//        String str2 = String.valueOf(scanner.nextLine());
//        String str3 = String.valueOf(scanner.nextLine());
////        if(str1.length() > str2.length()){
////            System.out.println("str1 длинне чем str2");
////        }if(str1.length() < str2.length()){
////            System.out.println("str1 короче чем str2");
////        } if(str3.length() < str2.length()){
////            System.out.println("str1 короче чем str2");
////        } if(str3.length() > str2.length()){
////            System.out.println("str1 короче чем str2");
////        }
//        str1 = (int) Math.max(str1,str2);

        //Пользователь вводит три дробных числа. Вывести те из них, квадратный корень которых меньше 2.

//        System.out.println("введите три дробных числа, после программа покажет число квадратный корень которого меньше 2");

//        Scanner scanner = new Scanner(System.in);
//        double x = scanner.nextInt();
//        double y = scanner.nextInt();
//        double z = scanner.nextInt();
//        double x1 = Math.sqrt(x);
//        double y1 = Math.sqrt(y);
//        double z1 = Math.sqrt(z);
//        System.out.println("Вы ввели:" +x);
//        System.out.println("Вы ввели:" +y);
//        System.out.println("Вы ввели:" +z);
////        System.out.println(x1);
////        System.out.println(y1);
////        System.out.println(z1);
//        if(x1 <= 2){
//            System.out.println("квадратный корень из х равен : " + x1);
//        }  if(y1 <= 2) {
//            System.out.println("квадратный корень из y равен: " + y1);
//        }  if(z1 <= 2) {
//            System.out.println("квадратный корень из z равен: " + z1);
//
//        }

        //Пройдите в дебаге программу:
        // x выводится 5 раз
//        int x = 1;
//        while(x >=-3){
//            System.out.print(x);
//            x = x -1;
//        }

        //Пройдите в дебаге программу:
        //метод str.length() вызывается 6 раз
//        String str = "Hell";
//        while(str.length() < 10) {
//            str = str + "o";
//        }
        //Пользователь вводит два числа. Разделить меньшее на большее и вывести результат.
//        System.out.println("Введите два числа, программа разделит меньшее на большее и покажет результат.");
//        Scanner scanner = new Scanner(System.in);
//        int number1 = scanner.nextInt();
//        int number2 = scanner.nextInt();
//        System.out.println("Первое число , которое вы ввели: " + number1);
//        System.out.println("Второе число , которое вы ввели: " + number2);
//        System.out.println("результат программы: " + number1 / number2);


        //Пользователь вводит строку. Используя substring, вывести первые 5 символов.
//        System.out.println("АХТУНГ ЮЗВЕРЬ! Введи произвольную строку!");
//        Scanner scanner = new Scanner(System.in);
//        String str = scanner.nextLine();
//        System.out.println("первые 5 символов этой строки: " + str.substring(0, 5));


    }
}
